Dlubal.DynamPro.DLCParams
Dynamic load case parameters

Dlubal.DynamPro.DLCParams.Number
Dynamic load case number (read only)

Dlubal.DynamPro.DLCParams.NaturalVibrationCase
Number of Natural Vibration Case to be used

Dlubal.DynamPro.DLCParams.ToSolve
Whether to solve this Dynamic Load Case on calculation

Dlubal.DynamPro.DLCParams.Description
Description

Dlubal.DynamPro.DLCParams.DynamicLoadCaseType
Dynamic load case analysis type

Dlubal.DynamPro.DLCParams.Comment
Comment